<?php

declare(strict_types=1);

return [
    /*
    |--------------------------------------------------------------------------
    | Domain
    |--------------------------------------------------------------------------
    |
    | 代表某一个酒店集团
    | 如果酒店是通过域名 http://hotel.beyondh.com 来访问别样红PMS系统的
    | 则 domain 即为 hotel
    |
    */
    'domain' => env('BEYONDH_DOMAIN', 'openapi'),

    /*
    |--------------------------------------------------------------------------
    | 接口环境地址
    |--------------------------------------------------------------------------
    */
    'url' => env('BEYONDH_URL', 'https://openapi.beyondh.com'),

    /*
    |--------------------------------------------------------------------------
    | 渠道 Key
    |--------------------------------------------------------------------------
    */
    'channel_key' => env('BEYONDH_CHANNEL_KEY', ''),

    /*
    |--------------------------------------------------------------------------
    | APP KEY
    |--------------------------------------------------------------------------
    */
    'app_key' => env('BEYONDH_APP_KEY', ''),

    /*
    |--------------------------------------------------------------------------
    | 日志记录
    |--------------------------------------------------------------------------
    |
    | 注意：该项不配置或配置空，将不会进行日志记录
    |
    */
    'logger' => [
        'handler' => [
            'class' => Monolog\Handler\StreamHandler::class,
            'constructor' => [
                'stream' => BASE_PATH . '/runtime/logs/beyondh.log',
                'level' => Monolog\Logger::DEBUG,
            ],
        ],
        'formatter' => [
            'class' => Monolog\Formatter\LineFormatter::class,
            'constructor' => [
                'format' => null,
                'dateFormat' => 'Y-m-d H:i:s',
                'allowInlineLineBreaks' => true,
            ],
        ],
    ],
];